build/docs/runtime/utils/entitymgrs/volatile/unsafe/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Unsafe Volatile Entity Manager</title>
<!-- 2017-04-27 Thu 09:31 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">Unsafe Volatile Entity Manager</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Implementation</a></li>
<li><a href="#sec-3">3. Use as a parent class</a></li>
<li><a href="#sec-4">4. Package&#xa0;&#xa0;&#xa0;<span class="tag"><span class="boilerplate">boilerplate</span></span></a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The purpose of the Unsafe Volatile Entity Manager (<code>UVEM</code>
for short) is twofold:
</p>

<ol class="org-ol">
<li>To provide a factory method (<code>mk_volatile_entry</code>) for
creating classes (entity classes).
</li>

<li>To manage a volatile store of instances of those
classes via <code>add</code>, <code>delete</code>, <code>update</code> and other
methods. 
</li>
</ol>

<p>
Instances of UVEM carry an instance of a volatile store
(dictionary mapping entity classes to lists).  No checks are
made when inserting or deleting entities; as a result the
entity aggregates may have duplicates or inconsistent or
non-uniform data (data or multiple entity types, or
arbitrary objects).
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Implementation</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">UnsafeVolatileEntityMgr</span>():
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">this store is volatile</span>
        <span style="font-weight: bold;">self</span>.db = {}

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">mk_volatile_entity</span>(<span style="font-weight: bold;">self</span>, cls):
        <span style="font-weight: bold; font-style: italic;">cls</span> = <span style="font-weight: bold;">type</span>(cls.<span style="font-weight: bold;">__name__</span>, (<span style="font-weight: bold;">object</span>,), <span style="font-weight: bold;">dict</span>(cls.__dict__))
        <span style="font-weight: bold;">self</span>.db[cls] = []
        <span style="font-weight: bold;">return</span> cls


    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">register_as_entity</span>(<span style="font-weight: bold;">self</span>, cls):
        <span style="font-weight: bold;">self</span>.db[cls] = []


    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">tests if entity is in aggregate</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">is_present</span>(<span style="font-weight: bold;">self</span>, entity):
        <span style="font-weight: bold;">return</span> entity <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.db[entity.__class__]



    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">assumes entity is not present in aggregate</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">unsafe_add</span>(<span style="font-weight: bold;">self</span>, entity):
        <span style="font-weight: bold; font-style: italic;">entity_set</span> = <span style="font-weight: bold;">self</span>.db[entity.__class__]
        entity_set.append(entity)

    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">assumes entity is in aggregate</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">unsafe_delete</span>(<span style="font-weight: bold;">self</span>, entity):
        <span style="font-weight: bold; font-style: italic;">entity_set</span> = <span style="font-weight: bold;">self</span>.db[entity.__class__]
        entity_set.remove(entity)

    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">assumes entity is in aggregate</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">unsafe_update</span>(<span style="font-weight: bold;">self</span>, entity, **args):
        <span style="font-weight: bold;">pass</span>

    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">assumes cls is the entity class    </span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">get_all</span>(<span style="font-weight: bold;">self</span>, cls):
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>.db[cls]

    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">usage: apply_filters(User, email=e1, name=n1)</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">apply_filters</span>(<span style="font-weight: bold;">self</span>, cls, **args):
        <span style="font-weight: bold; font-style: italic;">entities</span> = <span style="font-weight: bold;">self</span>.get_all(cls)

        <span style="font-weight: bold;">for</span> key, val <span style="font-weight: bold;">in</span>  args.iteritems():
           <span style="font-weight: bold; font-style: italic;">entities</span> = <span style="font-weight: bold;">filter</span>(<span style="font-weight: bold;">lambda</span> e: e.get(key) == val, entities)
        <span style="font-weight: bold;">return</span> entities
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Use as a parent class</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>UVEM</code> may be used as a parent of a child class.  The child
class should invoke <code>UVEM</code>'s <code>__init__</code> constructor with a
<code>self</code> argument in its own constructor as in the following
example.  It should override all the methods of <code>UVEM</code>. 
</p>
</div>
</div>



<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Package&#xa0;&#xa0;&#xa0;<span class="tag"><span class="boilerplate">boilerplate</span></span></h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">print</span> <span style="font-style: italic;">"runtime.utils.entitymgrs.unsafe package"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-04-27 Thu 09:31</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
